In [20]:
import mysql.connector
print("MySQL Connector is installed and imported successfully.")

MySQL Connector is installed and imported successfully.

In [21]:
#importing libraries
import pandas as pd
import mysql.connector
import numpy as np

In [25]:
# csv to dataframe
df_buses_1=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_1.csv")
df_buses_2=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_2.csv")
df_buses_3=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_3.csv")
df_buses_4=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_4.csv")
df_buses_5=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_5.csv")
df_buses_6=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_6.csv")
df_buses_7=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_7.csv")
df_buses_8=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_8.csv")
df_buses_9=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_9.csv")
df_buses_10=pd.read_csv(r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\busdata\df_buses_10.csv")
Final_df=pd.concat([df_buses_1,df_buses_2,df_buses_3,df_buses_4,df_buses_5,df_buses_6,
                    df_buses_7,df_buses_8,df_buses_9,df_buses_10],ignore_index=True)
Final_df

,Bus_name,Bus_type,Start_time,End_time,Total_duration,Price,Seats_Available,Ratings,Route_link,Route_name
0,KSRTC (Kerala) - 1586,Super Express Non AC Seater Air Bus (2+2),21:31,06:36,09h 05m,INR 640,27 Seats available,3.6\n33,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
1,KSRTC (Kerala) - 2133,Swift Deluxe Non AC Air Bus (2+2),22:12,07:36,09h 24m,INR 640,36 Seats available,4.3\n19,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
2,KSRTC (Kerala) - 2063,SWIFT-GARUDA A/C SEATER BUS,22:32,07:35,09h 03m,INR 627,5 Seats available,3.9\n47,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
3,KSRTC (Kerala) - 574,Super Express Non AC Seater Air Bus (2+2),23:00,09:30,10h 30m,INR 469,23 Seats available,3.2\n35,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
4,KSRTC (Kerala) - 583,Super Express Non AC Seater Air Bus (2+2),23:30,09:35,10h 05m,INR 469,21 Seats available,3.5\n65,https://www.redbus.in/bus-tickets/bangalore-to...,Bangalore to Kozhikode
...,...,...,...,...,...,...,...,...,...,...
626,Snemita Parisheba,AC Seater (2+3),05:50,09:30,03h 40m,304,21 Seats available,2.9,https://www.redbus.in/bus-tickets/barasat-west...,Barasat (West Bengal) to Contai (Kanthi)
627,SANTOSH BUS SERVICE,A/C Seater (2+3),05:55,09:30,03h 35m,INR 320,40 Seats available,New,https://www.redbus.in/bus-tickets/barasat-west...,Barasat (West Bengal) to Contai (Kanthi)
628,Aradhana Bus Service,A/C Seater / Sleeper (2+2),02:00,06:00,04h 00m,INR 580,61 Seats available,2.4,https://www.redbus.in/bus-tickets/barasat-west...,Barasat (West Bengal) to Contai (Kanthi)
629,Aradhana Bus Service,A/C Seater / Sleeper (2+2),02:30,06:00,03h 30m,INR 500,37 Seats available,2.4,https://www.redbus.in/bus-tickets/barasat-west...,Barasat (West Bengal) to Contai (Kanthi)
630,Aradhana Bus Service,Non AC Seater (2+3),00:40,05:00,04h 20m,INR 350,54 Seats available,2.4,https://www.redbus.in/bus-tickets/barasat-west...,Barasat (West Bengal) to Contai (Kanthi)

In [26]:
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 631 entries, 0 to 630
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         615 non-null    object
 1   Bus_type         615 non-null    object
 2   Start_time       615 non-null    object
 3   End_time         615 non-null    object
 4   Total_duration   615 non-null    object
 5   Price            615 non-null    object
 6   Seats_Available  615 non-null    object
 7   Ratings          615 non-null    object
 8   Route_link       631 non-null    object
 9   Route_name       631 non-null    object
dtypes: object(10)
memory usage: 49.4+ KB

In [27]:
#convert prices to numeric
Final_df["Price"]=Final_df["Price"].str.replace("INR","")
Final_df["Price"]=Final_df["Price"].astype(float)
Final_df["Price"].fillna(0)

0      640.0
1      640.0
2      627.0
3      469.0
4      469.0
       ...
626    304.0
627    320.0
628    580.0
629    500.0
630    350.0
Name: Price, Length: 631, dtype: float64

In [30]:
# Convert the entire 'Ratings' column to string type first
Final_df["Ratings"] = Final_df["Ratings"].astype(str)

# Remove 'New' from Ratings and handle other string operations
Final_df["Ratings"] = Final_df["Ratings"].str.replace("New", "", regex=False)
Final_df["Ratings"] = Final_df["Ratings"].str.strip()
Final_df["Ratings"] = Final_df["Ratings"].str.split().str[0]

# Convert the cleaned Ratings to numeric, coercing errors to NaN
Final_df["Ratings"] = pd.to_numeric(Final_df["Ratings"], errors='coerce')

# Fill NaN values with 0 (if needed)
Final_df["Ratings"] = Final_df["Ratings"].fillna(0)

In [31]:
# info after the data type change
Final_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 631 entries, 0 to 630
Data columns (total 10 columns):
 #   Column           Non-Null Count  Dtype
---  ------           --------------  -----
 0   Bus_name         615 non-null    object
 1   Bus_type         615 non-null    object
 2   Start_time       615 non-null    object
 3   End_time         615 non-null    object
 4   Total_duration   615 non-null    object
 5   Price            615 non-null    float64
 6   Seats_Available  615 non-null    object
 7   Ratings          631 non-null    float64
 8   Route_link       631 non-null    object
 9   Route_name       631 non-null    object
dtypes: float64(2), object(8)
memory usage: 49.4+ KB

In [32]:
Final_df = Final_df[Final_df["Price"] <= 7000]

In [33]:
Final_df = Final_df.replace({np.nan: None})

In [34]:
# change dataframe to csv
path=r"C:\Users\ELCOT\Downloads\PROJECT.1.Red Bus\FinalBusData\Final_bus_data.csv"
Final_df.to_csv(path,index=False)

#Create a mysql database

In [36]:
#sql connection
import mysql.connector

conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Nihitha@2595"
)
my_cursor = conn.cursor()

#Create the database if it doesn't exist
my_cursor.execute("CREATE DATABASE IF NOT EXISTS RED_BUS_DETAILS")
print("Database 'RED_BUS_DETAILS' created or already exists.")

Database 'RED_BUS_DETAILS' created or already exists.

In [38]:
# Step 1: Connect to MySQL
conn = mysql.connector.connect(
    host="localhost",
    user="root",
    password="Nihitha@2595",
    database="RED_BUS_DETAILS"  # Specify the database here
)

# Step 2: Create a cursor object
my_cursor = conn.cursor()

# Step 3: Create the table if it doesn't exist
my_cursor.execute('''
    CREATE TABLE IF NOT EXISTS bus_details(
        ID INT AUTO_INCREMENT PRIMARY KEY,
        Bus_name VARCHAR(255) NOT NULL,
        Bus_type VARCHAR(255) NOT NULL,
        Start_time VARCHAR(255) NOT NULL,
        End_time VARCHAR(255) NOT NULL,
        Total_duration VARCHAR(255) NOT NULL,
        Price FLOAT NULL,
        Seats_Available VARCHAR(255) NOT NULL,
        Ratings FLOAT NULL,
        Route_link VARCHAR(255) NULL,
        Route_name VARCHAR(255) NULL
    )
''')

print("Table Created successfully")

Table Created successfully

In [39]:
# SQL query to insert data into bus_details table
insert_query = '''INSERT INTO bus_details(
                    Bus_name,
                    Bus_type,
                    Start_time,
                    End_time,
                    Total_duration,
                    Price,
                    Seats_Available,
                    Ratings,
                    Route_link,
                    Route_name)
                  VALUES(%s, %s, %s, %s, %s, %s, %s, %s, %s, %s)'''
data = Final_df.values.tolist()

my_cursor.executemany(insert_query, data)

conn.commit()

print("Values inserted successfully")

Values inserted successfully